public class IncrementPuzzle {
    public static void main(String[] args) {
        int a = 5; // a = 5
        int b = a++; // b = 5, a = 6: здесь постфиксный инкремент, поэтому а отдает b свое значение,
        // только после этого меняется в большую сторону
        int c = ++a; // а = 7, с = 7: здесь префиксный инкремент, поэтому а, которая теперь равна 6, увеличивается до 7,
        //после чего отдает свое значение с
        int d = a-- + --b; // d = 7 + 4: а-- постфиксный декремент, поэтому а(7) отдает свое значение для сложения и
        // уменьшается до 6, --b префиксный декремент, поэтому b уменьшается до 4 и отдает свое значение
        System.out.println(a + " " + b + " " + c + " " + d); // вывод: 6 4 7 11

    }
}
